app/controllers/environments_controller.rb

  def index
    @environments = Environment.all
---
SELECT "environments".* FROM "environments"

    def set_environment
      @environment = Environment.find(params[:id])
---
SELECT "environments".* FROM "environments" WHERE "environments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]