app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
  def index
    @regions = Region.all

SELECT "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_region
      @region = Region.find(params[:id])